## Learn Pandas

In [2]:
from numpy import nan as NA # missing value -> NA
import pandas as pd
# dict
data = {'ID': [1,2,3,4,5],
        'name': ['Kim', 'Choi', 'Park', NA, 'Lee'],
        'class': [1,1,1,2,2],
        'score': [100, NA, 92, 70, 80]}
df = pd.DataFrame(data) # pandas DataFrame
df

   ID  name  class  score
0   1   Kim      1  100.0
1   2  Choi      1    NaN
2   3  Park      1   92.0
3   4   NaN      2   70.0
4   5   Lee      2   80.0

In [3]:
df.info() # you can see Data type of variables

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   name    4 non-null      object
 2   class   5 non-null      int64
 3   score   4 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 288.0+ bytes

In [4]:
df.shape # return (row, columns)

(5, 4)

In [6]:
df[df.score > 80] # dot approach(df.score) and like if statement

   ID  name  class  score
0   1   Kim      1  100.0
2   3  Park      1   92.0

In [7]:
df.score

0    100.0
1      NaN
2     92.0
3     70.0
4     80.0
Name: score, dtype: float64

In [8]:
df[['ID', 'score']] # over 2 variable -> use braket !

   ID  score
0   1  100.0
1   2    NaN
2   3   92.0
3   4   70.0
4   5   80.0

In [9]:
df.index = ['A', 'B', 'C', 'D', 'E'] # make index
df

   ID  name  class  score
A   1   Kim      1  100.0
B   2  Choi      1    NaN
C   3  Park      1   92.0
D   4   NaN      2   70.0
E   5   Lee      2   80.0

In [13]:
# iloc / loc

# index number is standard in iloc

df.iloc[1, :3]
df.iloc[1:3, 2:]

   class  score
B      1    NaN
C      1   92.0

In [16]:
# just index or name is standard in loc

df.loc['A', 'class']
df.loc[['A', 'B'], ['class', 'score']]

   class  score
A      1  100.0
B      1    NaN

In [18]:
df.isnull() # return dataframe -> missing value is occured True !!
df.isnull().sum() # count all missing value

ID       0
name     1
class    0
score    1
dtype: int64

In [19]:
df.isnull().any() # if missing value exist -> return True

ID       False
name      True
class    False
score     True
dtype: bool

In [20]:
df.score.notnull().sum() # reverse isnull()

4

In [21]:
df.dropna() # Delete Missing value (**do not use in big data)

   ID  name  class  score
A   1   Kim      1  100.0
C   3  Park      1   92.0
E   5   Lee      2   80.0

In [22]:
df.dropna(subset=['score']) # if score variable has missing value -> delete

   ID  name  class  score
A   1   Kim      1  100.0
C   3  Park      1   92.0
D   4   NaN      2   70.0
E   5   Lee      2   80.0

**inplace=True -> apply change(ex. delete .. )**
## do not use first!!

**Deal with missing value** (fillna...)

In [23]:
df.name.fillna('Unknown') # replace missing value (NaN -> Unknown) name
# but not applyed so if you want to change, please use inplace=True
df.fillna({'score': df.score.mean()}) # you can replace specific value (ex.score)

   ID  name  class  score
A   1   Kim      1  100.0
B   2  Choi      1   85.5
C   3  Park      1   92.0
D   4   NaN      2   70.0
E   5   Lee      2   80.0

In [24]:
df.fillna({'name': 'Unknown', 'score': df.score.mean()}, inplace=True)
df

   ID     name  class  score
A   1      Kim      1  100.0
B   2     Choi      1   85.5
C   3     Park      1   92.0
D   4  Unknown      2   70.0
E   5      Lee      2   80.0

In [25]:
# add new variable to Dataframe
df['diff'] = df.score - df.score.mean() # use original variable(available)
df['new_score'] = [98, 90, 80, 85, 70]
df

   ID     name  class  score  diff  new_score
A   1      Kim      1  100.0  14.5         98
B   2     Choi      1   85.5   0.0         90
C   3     Park      1   92.0   6.5         80
D   4  Unknown      2   70.0 -15.5         85
E   5      Lee      2   80.0  -5.5         70

In [26]:
# rename variable name
df.rename(columns = {'diff' : 'mean_diff', 'diff2': 'mean_diff2'}, inplace=True)
df

   ID     name  class  score  mean_diff  new_score
A   1      Kim      1  100.0       14.5         98
B   2     Choi      1   85.5        0.0         90
C   3     Park      1   92.0        6.5         80
D   4  Unknown      2   70.0      -15.5         85
E   5      Lee      2   80.0       -5.5         70

In [ ]:
# delete variable(axis=1 cause column)
df.drop(['mean_diff', 'mean_diff2'], axis=1)

## groupby function

DataFrame.groupby(by=None, axis=_NoDefault.no_default, level=None, as_index=True, sort=True, group_keys=True, observed=_NoDefault.no_default, dropna=True)[source]

1. splitting
2. applying function
3. combining result

In [30]:
df.groupby('class').score.mean()

class
1    92.5
2    75.0
Name: score, dtype: float64

In [31]:
df[['class', 'score']].groupby('class').mean() # same above

       score
class
1       92.5
2       75.0

In [32]:
df[['class', 'score', 'new_score']].groupby('class').mean() # this method is more proper to use when 2 more variable

       score  new_score
class
1       92.5  89.333333
2       75.0  77.500000

In [34]:
# isin function -> extract specific observaion
df[df.name.isin(['Kim', 'Lee'])] # kind of filter

   ID name  class  score  mean_diff  new_score
A   1  Kim      1  100.0       14.5         98
E   5  Lee      2   80.0       -5.5         70